Revit 2024 API
TransactionGroup.GetName Method
 Returns the transaction group's name. It could be an empty string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public string GetName()
Visual Basic
Public Function GetName As String
Visual C++
public:
String^ GetName()
Return Value
 The transaction group's current name.
See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace